holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    if(code == LV_EVENT_CLICKED) {
        current_gps_panel=2;
        printf("[switch_gnrmc_panel_event_cb] Switching to GNRMC panel.\n");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void switch_gpatt_panel_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[switch_gpatt_panel_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        current_gps_panel=3;
        printf("[switch_gpatt_panel_event_cb] Switching to GPATT panel.\n");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void current_matrix_override_off_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[current_matrix_override_off_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        printf("[current_matrix_override_off_event_cb] OVERRIDING matrix switch %d\n", current_matrix_i);
        setOverrideOutputValue((int)current_matrix_i, (uint32_t)0);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void btn_location_mode_gps_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[btn_location_mode_gps_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        satioData.location_value_mode = SATIO_MODE_GPS;
        printf("[btn_location_mode_gps_event_cb] Setting location value mode SATIO_MODE_GPS");
    }
}
/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void btn_location_mode_user_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[btn_location_mode_user_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        satioData.location_value_mode = SATIO_MODE_USER;
        printf("[btn_location_mode_user_event_cb] Setting location value mode SATIO_MODE_USER");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void btn_altitude_mode_gps_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[btn_altitude_mode_gps_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        satioData.altitude_value_mode = SATIO_MODE_GPS;
        printf("[btn_altitude_mode_gps_event_cb] Setting altitude value mode SATIO_MODE_GPS");
    }
}
/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void btn_altitude_mode_user_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[btn_altitude_mode_user_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        satioData.altitude_value_mode = SATIO_MODE_USER;
        printf("[btn_altitude_mode_user_event_cb] Setting altitude value mode SATIO_MODE_USER");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void btn_speed_mode_gps_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[btn_speed_mode_gps_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        satioData.speed_value_mode = SATIO_MODE_GPS;
        printf("[btn_speed_mode_gps_event_cb] Setting speed value mode SATIO_MODE_GPS");
    }
}
/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void btn_speed_mode_user_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[btn_speed_mode_user_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        satioData.speed_value_mode = SATIO_MODE_USER;
        printf("[btn_speed_mode_user_event_cb] Setting speed value mode SATIO_MODE_USER");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void btn_ground_heading_mode_gps_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[btn_ground_heading_mode_gps_event_cb] event code: %d\n", code);}

