holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Main style: text
    lv_obj_set_style_text_align(tray.panel, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_font(tray.panel, font_menu_item, LV_PART_MAIN);
    lv_obj_set_style_text_color(tray.panel, default_title_hue, LV_PART_MAIN);

    /* ---------------------------------- TRAY BRIGHTNESS ------------------------------- */
    
    // Create brightness slider
    tray.slider_brightness = create_slider(
        tray.panel,             // parent: tray panel
        200,                    // width
        8,                      // height  
        LV_ALIGN_BOTTOM_MID,    // alignment
        0,                      // x offset
        0,                      // y offset
        21,                     // min value
        100,                    // max value
        slider_brightness_value // initial value
    );
    
    // Add brightness slider event callback
    lv_obj_add_event_cb(tray.slider_brightness, slider_brightness_event_cb, 
                       LV_EVENT_VALUE_CHANGED, NULL);
    
    // -------------------------------- Objects --------------------------------- //

    // Time
    tray.local_time = create_label(
        tray.panel,           // parent
        128,                  // width
        20,                   // height
        LV_ALIGN_TOP_MID,     // parent alignment
        0,                    // pos x
        10,                   // pos y
        "00:00:00",           // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_25,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    // Date
    tray.local_date = create_label(
        tray.panel,           // parent
        128,                  // width
        20,                   // height
        LV_ALIGN_TOP_MID,     // parent alignment
        0,                    // pos x
        30,                   // pos y
        "00/00/00",           // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_25,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    // Human Date
    tray.human_date = create_label(
        tray.panel,           // parent
        340,                  // width
        20,                   // height
        LV_ALIGN_TOP_MID,     // parent alignment
        0,                    // pos x
        50,                   // pos y
        "",                   // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    // Datetime Sync
    tray.datetime_sync = create_label(
        tray.panel,           // parent
        90,                   // width
        20,                   // height
        LV_ALIGN_TOP_MID,     // parent alignment
        120,                  // pos x
        24,                   // pos y
        "GPS SYNC",           // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    // GPS Signal
    tray.gps_signal_strength = create_label(
        tray.panel,           // parent
        90,                   // width
        20,                   // height
        LV_ALIGN_TOP_MID,     // parent alignment
        120,                  // pos x
        24,                   // pos y
        "0:0",                // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    // SDCard Status
    tray.sdcard_mounted = create_label(
        tray.panel,           // parent
        40,                   // width
        20,                   // height
        LV_ALIGN_TOP_MID,     // parent alignment
        -140,                 // pos x
        24,                   // pos y
        "SD",                 // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    // Grid Menu 1
    tray.grid_menu_1 = create_menu_grid(
        tray.panel,          // lv_obj_t
        7,                   // cols
        1,                   // rows
        56,                  // cell size px
        12,                  // outer padding
        12,                  // inner padding
        0,                   // pos x
        0,                   // pos y
        LV_ALIGN_CENTER,     // alignment
        radius_rounded,      // item radius
        7,                   // Max visbilble columns. Equal or less than cols
        1,                   // Max visible rows. Equal or less than rows
        false,               // show scrollbar
        false,               // enable scrolling
        LV_TEXT_ALIGN_CENTER,// font alignment
        &cobalt_alien_17,    // font
        true,
        true
    );
    // Grid Menu 1 Configuration
    uint32_t grid_child_cnt = lv_obj_get_child_cnt(tray.grid_menu_1);
    for(uint32_t i = 0; i < grid_child_cnt; i++) {
        lv_obj_t * btn = lv_obj_get_child(tray.grid_menu_1, i);
        // Add callback
        lv_obj_add_event_cb(btn, system_tray_grid_menu_1_event_cb, LV_EVENT_CLICKED, NULL);
        lv_obj_set_style_outline_color(btn, default_outline_hue, LV_PART_MAIN);
        // Get label
        lv_obj_t * label = lv_obj_get_child(btn, 0);
        if(label && lv_obj_has_class(label, &lv_label_class)) {
            // Set label text
            switch (i) {
                case 0: lv_label_set_text(label, "Home"); break; // Home
                case 1: lv_label_set_text(label, "Mtx"); break; // Matrix
                case 2: lv_label_set_text(label, "GPS"); break; // GPS
                case 3: lv_label_set_text(label, "Gyro"); break; // Gyro
                case 4: lv_label_set_text(label, "Dis"); break; // Display
                case 5: lv_label_set_text(label, "Sys"); break; // System
                case 6: lv_label_set_text(label, "?"); break; // ?
                default: break;
            }
        }
    }

    // Ensure system tray is always on top of other objects
    lv_obj_move_foreground(tray.panel);
    
    return tray;
}

/** -------------------------------------------------------------------------------------
 * @brief Create Slider
 */
lv_obj_t * create_slider(
    lv_obj_t * scr,
    int32_t size_w_px,
    int32_t size_h_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    int32_t range_min,
    int32_t range_max,
    int32_t range_value
    )
{
    /*----------------------------------------------- SLIDER -----------------------------------------------*/

    // Create slider
    lv_obj_t * slider = lv_slider_create(scr);

