holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Main style: radius
    lv_obj_set_style_radius(result.kb, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.kb, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.kb, default_outline_hue, LV_PART_MAIN);
    
    // Main style: border
    lv_obj_set_style_border_width(result.kb, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.kb, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(result.kb, default_bg_hue, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.kb, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.kb, default_shadow_hue, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(result.kb, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_font(result.kb, font_menu_item, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.kb, default_title_hue, LV_PART_MAIN);

    /*-------------------------------------- KEYBOARD LV_PART_ITEMS ---------------------------------------*/

    // Item style: radius
    lv_obj_set_style_radius(result.kb, general_radius, LV_PART_ITEMS);

    // Item style: outline
    lv_obj_set_style_outline_width(result.kb, outline_width, LV_PART_ITEMS);
    lv_obj_set_style_outline_color(result.kb, default_outline_hue, LV_PART_ITEMS);

    // Item style: border
    lv_obj_set_style_border_width(result.kb, border_width, LV_PART_ITEMS);
    lv_obj_set_style_border_color(result.kb, default_border_hue, LV_PART_ITEMS);

    // Item style: background
    lv_obj_set_style_bg_color(result.kb, default_bg_hue, LV_PART_ITEMS);

    // Item style: shadow
    lv_obj_set_style_shadow_width(result.kb, shadow_width, LV_PART_ITEMS);
    lv_obj_set_style_shadow_color(result.kb, default_shadow_hue, LV_PART_ITEMS);

    // Item style: text
    lv_obj_set_style_text_align(result.kb, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_font(result.kb, font_menu_item, LV_PART_ITEMS);
    lv_obj_set_style_text_color(result.kb, default_title_hue, LV_PART_ITEMS);
    
    // Item style: background checked
    lv_obj_set_style_bg_color(result.kb, default_border_hue, LV_PART_ITEMS | LV_STATE_CHECKED);
    
    // Item style: text checked
    lv_obj_set_style_text_align(result.kb, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_font(result.kb, font_menu_item, LV_PART_ITEMS | LV_STATE_CHECKED);
    lv_obj_set_style_text_color(result.kb, default_title_hue, LV_PART_ITEMS | LV_STATE_CHECKED);

    /*---------------------------------------------- TEXTAREA -----------------------------------------------*/

    // Create text area
    result.ta = lv_textarea_create(scr);

    // Connect keyboard to textarea
    lv_keyboard_set_textarea(result.kb, result.ta);

    // Get keyboard coordinates
    lv_area_t kb_coords;
    lv_obj_get_coords(result.kb, &kb_coords);
    lv_coord_t ta_x = kb_coords.x1;
    lv_coord_t ta_y = kb_coords.y1 - ta_height_px;

    // Size and position
    lv_obj_set_size(result.ta, size_w_px, ta_height_px);
    lv_obj_set_pos(result.ta, ta_x, ta_y-kb_ta_padding_px);

    /*--------------------------------------- TEXTAREA LV_PART_MAIN -----------------------------------------*/

    // Main style: radius
    lv_obj_set_style_radius(result.ta, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.ta, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.ta, default_outline_hue, LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(result.ta, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.ta, default_border_hue, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.ta, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.ta, default_shadow_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(result.ta, default_bg_hue, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(result.ta, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_font(result.ta, font_menu_item, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.ta, default_title_hue, LV_PART_MAIN);

    return result;
}

/** -----------------------------------------------------------------------------------------------
 * @brief Create Menu Item.
 * 
 * Intention is to be resusable, flexible & while providing a consistent style.
 * 
 * @param menu_page Pointer to the parent menu_x object.
 * @param title Title of the menu_x page.
 * @return Pointer to the created menu_x page object.
 */
void create_menu_item(menu_struct * menu, int page_index, const char * title) {

    /*--------------------------------------------- CONTAINER -----------------------------------------------*/

    // Create container
    lv_obj_t * container = lv_menu_cont_create(menu->pages[page_index]);

    /*-------------------------------------- CONTAINER LV_PART_MAIN -----------------------------------------*/
    
    // Size and position
    lv_obj_set_style_pad_hor(container, 2, LV_PART_MAIN);
    lv_obj_set_style_pad_ver(container, 4, LV_PART_MAIN);
    lv_obj_set_width(container, lv_pct(80));

    // Main style: radius
    lv_obj_set_style_radius(container, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(container, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(container, lv_color_make(0,0,0), LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(container, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(container, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(container, default_bg_hue, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(container, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(container, default_shadow_hue, LV_PART_MAIN);

