holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Main style: text
    lv_obj_set_style_text_align(container, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_font(container, font_menu_item, LV_PART_MAIN);
    lv_obj_set_style_text_color(container, default_title_hue, LV_PART_MAIN);

    /*----------------------------------------------- LABEL -----------------------------------------------*/
    
    // Create label
    lv_obj_t * label = lv_label_create(container);

    /* --- LABEL LV_PART_MAIN ---------------------------------------------------------- */

    // Size and position
    lv_obj_set_style_pad_hor(label, 8, LV_PART_MAIN);
    lv_obj_set_style_pad_ver(label, 8, LV_PART_MAIN);
    lv_obj_set_width(label, lv_pct(100));

    // Main style: radius
    lv_obj_set_style_radius(label, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(label, 0, LV_PART_MAIN);
    lv_obj_set_style_outline_color(label, lv_color_make(0,0,0), LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(label, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(label, default_border_hue, LV_PART_MAIN);
    
    // Main style: background
    lv_obj_set_style_bg_color(label, default_bg_hue, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(label, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(label, default_shadow_hue, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_color(label, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_font(label, font_menu_item, LV_PART_MAIN);
    lv_label_set_text(label, title);

    /* --- ADD TO MENU ----------------------------------------------------------------- */
    
    // Add to menu struct
    if(menu->page_item_counts[page_index] < menu->max_items_per_page) {
        menu->page_items[page_index][menu->page_item_counts[page_index]] = container;
        menu->page_item_counts[page_index]++;
    }
}

/** -----------------------------------------------------------------------------------------------
 * @brief Create Menu Page.
 * 
 * Intention is to be resusable, flexible & while providing a consistent style.
 * 
 * @param menu_x Pointer to the parent menu_x object.
 * @param title Title of the menu_x page.
 * @return Pointer to the created menu_x page object.
 */
lv_obj_t * create_menu_page(lv_obj_t * menu_x, const char * title) {

    /* --- MENU ------------------------------------------------------------------------ */

    // Create menu
    lv_obj_t * menu_page = lv_menu_page_create(menu_x, title);

    /* --- MENU LV_PART_MAIN ----------------------------------------------------------- */

    // Size and position
    lv_obj_set_style_pad_row(menu_page, 2, LV_PART_MAIN);
    lv_obj_set_style_pad_column(menu_page, 2, LV_PART_MAIN);

    // Main style: radius
    lv_obj_set_style_radius(menu_page, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(menu_page, 0, LV_PART_MAIN);
    lv_obj_set_style_outline_color(menu_page, default_outline_hue, LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(menu_page, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(menu_page, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(menu_page, default_bg_hue, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(menu_page, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(menu_page, default_shadow_hue, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(menu_page, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_color(menu_page, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_font(menu_page, font_menu_item, LV_PART_MAIN);

    return menu_page;
}

/** -----------------------------------------------------------------------------------------------
 * @brief Create Menu
 * 
 * Intention is to be resusable, flexible & while providing a consistent style.
 * 
 * @param scr Pointer to the parent screen object.
 * @param max_pages Maximum number of pages in the menu.
 * @param page_titles Array of page titles (NULL-terminated).
 * @param main_menu_items Array of main menu item titles (NULL-terminated).
 * @param size_w_px Width of the menu in pixels.
 * @param size_h_px Height of the menu in pixels.
 * @param alignment Alignment of the menu within its parent/screen.
 * @param pos_x X position of the menu within its parent/screen.
 * @param pos_y Y position of the menu within its parent/screen.
 * 
 */
menu_struct create_menu(
    lv_obj_t *scr,
    int max_pages,
    const char ** page_titles,
    const char ** main_menu_items,
    int32_t size_w_px,
    int32_t size_h_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y
    )
{
    /* --- MENU ------------------------------------------------------------------------ */

    // Create a new menu_struct
    menu_struct result = {0};
    
    // Allocate pages arrays
    result.max_pages = max_pages;
    result.pages = (lv_obj_t **)malloc(max_pages * sizeof(lv_obj_t *));
    result.page_items = (lv_obj_t ***)malloc(max_pages * sizeof(lv_obj_t **));
    result.page_item_counts = (uint32_t *)calloc(max_pages, sizeof(uint32_t));
    
    // Allocate items arrays for each page
    result.max_items_per_page = 10;  // Max items per page
    for(int p = 0; p < max_pages; p++) {
        result.page_items[p] = (lv_obj_t **)malloc(result.max_items_per_page * sizeof(lv_obj_t *));
    }

    // Create menu
    result.menu = lv_menu_create(scr);

    // Size and position
    lv_obj_set_size(result.menu, size_w_px, size_h_px);
    lv_obj_align(result.menu, alignment, pos_x, pos_y);

    /* --- MENU LV_PART_MAIN ----------------------------------------------------------- */

    // Size and position
    lv_obj_set_style_transform_width(result.menu, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_row(result.menu, 4, LV_PART_MAIN);
    lv_obj_set_style_pad_column(result.menu, 2, LV_PART_MAIN);

