holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    vTaskDelay(5 / portTICK_PERIOD_MS);

    /* ---------------------------------------------------------- */
    /* Row Altitude Mode                                          */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_alt_mode = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = (((sub_row_width/4) *1)) - (sub_column_padding*2);
    obj_w_2 = (((sub_row_width/4) *1)) - (sub_column_padding*2);

    result.lbl_altitude_mode= create_label(
        row_alt_mode,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Altitude Mode",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.btn_altitude_mode_gps = create_button(
        row_alt_mode,         // parent
        obj_w_1,              // width px
        obj_height,           // height px
        LV_ALIGN_CENTER,      // alignment
        0,                    // pos x
        0,                    // pos y
        "GPS",                // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded,
        default_btn_off_bg,
        default_btn_off_value_hue
    );
    lv_obj_add_event_cb(result.btn_altitude_mode_gps.button, btn_altitude_mode_gps_event_cb, LV_EVENT_CLICKED, NULL);

    result.btn_altitude_mode_user = create_button(
        row_alt_mode,         // parent
        obj_w_2,              // width px
        obj_height,           // height px
        LV_ALIGN_CENTER,      // alignment
        0,                    // pos x
        0,                    // pos y
        "User",               // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded,
        default_btn_off_bg,
        default_btn_off_value_hue
    );
    lv_obj_add_event_cb(result.btn_altitude_mode_user.button, btn_altitude_mode_user_event_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_set_size(result.lbl_altitude_mode, obj_w_0, obj_height);
    lv_obj_set_size(result.btn_altitude_mode_gps.panel, obj_w_1, obj_height);
    lv_obj_set_size(result.btn_altitude_mode_user.panel, obj_w_2, obj_height);

    vTaskDelay(5 / portTICK_PERIOD_MS);

    /* ---------------------------------------------------------- */
    /* Title Speed                                                */
    /* ---------------------------------------------------------- */
    lv_obj_t * row_title_speed = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    obj_w_0 = sub_row_width - (sub_column_padding);

    result.lbl_title_speed = create_label(
        row_title_speed,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "SPEED",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_title_hue,
        default_title_hue
    );

    lv_obj_set_size(result.lbl_title_speed, obj_w_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row GPS Speed                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_gps_speed = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    obj_w_0 = 250;
    obj_w_1 = (((sub_row_width) *1) - obj_w_0) - (sub_column_padding*2);

    result.lbl_speed = create_label(
        row_gps_speed,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[GPS] Speed",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_speed = create_label(
        row_gps_speed,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_speed, obj_w_0, obj_height);
    lv_obj_set_size(result.val_speed, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row User Speed                                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_user_speed = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    obj_w_0 = 250;
    obj_w_2 = 30;
    obj_w_1 = (((sub_row_width/1) *1) - obj_w_0 - obj_w_2) - (sub_column_padding*3);

    result.lbl_user_speed = create_label(
        row_user_speed,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[USER] Speed",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.ta_user_speed = create_textarea(
        row_user_speed,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        true,
        "0123456789.-",
        "0",
        false,
        false,
        false,
        &cobalt_alien_17,
        LV_TEXT_ALIGN_CENTER
    );
    lv_obj_add_event_cb(result.ta_user_speed, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_user_speed, &user_speed_ctx);

    result.btn_auto_set_user_speed = create_button(
        row_user_speed,
        obj_w_2,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "+",
        LV_TEXT_ALIGN_CENTER,
        false,
        false,
        &cobalt_alien_17,
        radius_rounded,
        default_btn_bg,
        default_btn_toggle_value_hue
    );
    lv_obj_add_event_cb(result.btn_auto_set_user_speed.button, btn_auto_set_user_speed_event_cb, LV_EVENT_CLICKED, NULL);

