holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Set row object widths
    obj_w_0 = (((sub_row_width/4) *1)) - (sub_column_padding*1);

    result.lbl_gyro_0_acc_x = create_label(
        row_3,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "G-FORCE",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_gyro_0_acc_x = create_label(
        row_3,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    result.val_gyro_0_acc_y = create_label(
        row_3,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    result.val_gyro_0_acc_z = create_label(
        row_3,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_gyro_0_acc_x, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_acc_x, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_acc_y, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_acc_z, obj_w_0, obj_height);


    /* ---------------------------------------------------------- */
    /* Row 6: Gyro                                                */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_6 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = (((sub_row_width/4) *1)) - (sub_column_padding*1);

    result.lbl_gyro_0_gyr_x = create_label(
        row_6,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "GYRO",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_gyro_0_gyr_x = create_label(
        row_6,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    result.val_gyro_0_gyr_y = create_label(
        row_6,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    result.val_gyro_0_gyr_z = create_label(
        row_6,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_gyro_0_gyr_x, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_gyr_x, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_gyr_y, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_gyr_z, obj_w_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 9: Mag                                                 */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_9 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = (((sub_row_width/4) *1)) - (sub_column_padding*1);

    result.lbl_gyro_0_mag_x = create_label(
        row_9,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "MAG",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_gyro_0_mag_x = create_label(
        row_9,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    result.val_gyro_0_mag_y = create_label(
        row_9,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    result.val_gyro_0_mag_z = create_label(
        row_9,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_gyro_0_mag_x, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_mag_x, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_mag_y, obj_w_0, obj_height);
    lv_obj_set_size(result.val_gyro_0_mag_z, obj_w_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row 12: Current UI Baud Rate                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_12 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

