holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
        }

        // Matrix New
        if (matrix_new.panel) {
            lv_obj_set_style_outline_color(matrix_new.panel, default_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_new.label, default_value_hue, LV_PART_MAIN);
        }

        // Matrix Save
        if (matrix_save.panel) {
            lv_obj_set_style_outline_color(matrix_save.panel, default_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_save.label, default_value_hue, LV_PART_MAIN);
        }

        // Matrix Load
        if (matrix_load.panel) {
            lv_obj_set_style_outline_color(matrix_load.panel, default_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_load.label, default_value_hue, LV_PART_MAIN);
        }

        // Matrix Delete
        if (matrix_delete.panel) {
            lv_obj_set_style_outline_color(matrix_delete.panel, default_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_delete.label, default_value_hue, LV_PART_MAIN);
        }
        
        // Matrix Configuration Panel
        if (current_matrix_panel_view==0) {
            if (mfc.panel) {

                // Hide
                lv_obj_add_flag(mcc.panel, LV_OBJ_FLAG_HIDDEN);
                vTaskDelay(5 / portTICK_PERIOD_MS);

                // Show
                lv_obj_remove_flag(mfc.panel, LV_OBJ_FLAG_HIDDEN);
                vTaskDelay(5 / portTICK_PERIOD_MS);

                // Switch
                lv_obj_set_style_outline_color(switch_matrix_mapping_panel.panel, default_outline_hue, LV_PART_MAIN);
                lv_label_set_text(switch_matrix_mapping_panel.label, "MATRIX");
                lv_obj_set_style_text_color(switch_matrix_mapping_panel.label, default_value_hue, LV_PART_MAIN);

                // Panel
                lv_obj_set_style_outline_color(mfc.panel, main_outline_hue, LV_PART_MAIN);

                // Label Current Switch
                lv_obj_set_style_text_color(mfc.label_switch_index_select, default_value_hue, LV_PART_MAIN);

                // Value Current Switch
                lv_dropdown_set_selected(mfc.dd_switch_index_select, current_matrix_i);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_switch_index_select), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_switch_index_select), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);

                // Value Current Function
                lv_dropdown_set_selected(mfc.dd_function_index_select, current_matrix_function_i);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_function_index_select), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_function_index_select), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);

                // Value Primary Function Comparotor
                lv_dropdown_set_selected(mfc.dd_function_name, matrixData.matrix_function[0][current_matrix_i][current_matrix_function_i]);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_function_name), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_function_name), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);

                // X Comparitor Mode
                lv_dropdown_set_selected(mfc.dd_mode_x, matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_x), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_x), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);

                // X Value
                if (matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]==0) {
                    // Mode 0: User Defined
                    if (!strcmp(
                        String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]).c_str(),
                        lv_textarea_get_text(mfc.ta_x))==0)
                        {
                            lv_textarea_set_text(mfc.ta_x, String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]).c_str());
                        }
                    lv_obj_add_flag(mfc.dd_x, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_remove_flag(mfc.ta_x, LV_OBJ_FLAG_HIDDEN);
                }
                else {
                    // Mode 1: System Defined
                    lv_dropdown_set_selected(mfc.dd_x, matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]);
                    lv_obj_add_flag(mfc.ta_x, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_remove_flag(mfc.dd_x, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_x), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_x), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);
                }

                // Y Comparitor Mode
                lv_dropdown_set_selected(mfc.dd_mode_y, matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_y), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_y), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);
                // Y Value
                if (matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]==0) {
                    // Mode 0: User Defined
                    if (!strcmp(
                        String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]).c_str(),
                        lv_textarea_get_text(mfc.ta_y))==0)
                        {
                            lv_textarea_set_text(mfc.ta_y, String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]).c_str());
                        }
                    lv_obj_add_flag(mfc.dd_y, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_remove_flag(mfc.ta_y, LV_OBJ_FLAG_HIDDEN);
                }
                else {
                    // Mode 1: System Defined
                    lv_dropdown_set_selected(mfc.dd_y, matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]);
                    lv_obj_add_flag(mfc.ta_y, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_remove_flag(mfc.dd_y, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_y), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_y), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);
                }

