holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // Z Comparitor Mode
                lv_dropdown_set_selected(mfc.dd_mode_z, matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_z), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_z), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);

                // Z Value
                if (matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]==0) {
                    // Mode 0: User Defined
                    if (!strcmp(
                        String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]).c_str(),
                        lv_textarea_get_text(mfc.ta_z))==0)
                        {
                            lv_textarea_set_text(mfc.ta_z, String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]).c_str());
                        }
                    lv_obj_add_flag(mfc.dd_z, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_remove_flag(mfc.ta_z, LV_OBJ_FLAG_HIDDEN);
                }
                else {
                    // Mode 1: System Defined
                    lv_dropdown_set_selected(mfc.dd_z, matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]);
                    lv_obj_add_flag(mfc.ta_z, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_remove_flag(mfc.dd_z, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_z), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_z), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);
                }

                // Operator
                lv_dropdown_set_selected(mfc.dd_operator, matrixData.matrix_switch_operator_index[0][current_matrix_i][current_matrix_function_i]);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_operator), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_operator), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);

                // Inverted
                lv_dropdown_set_selected(mfc.dd_inverted_logic, matrixData.matrix_switch_inverted_logic[0][current_matrix_i][current_matrix_function_i]);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_inverted_logic), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_inverted_logic), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);

                // PWM Off
                if (!strcmp(
                    String(matrixData.output_pwm[0][current_matrix_i][0]).c_str(),
                    lv_textarea_get_text(mfc.ta_pwm_0))==0)
                    {
                        lv_textarea_set_text(mfc.ta_pwm_0, String(matrixData.output_pwm[0][current_matrix_i][0]).c_str());
                    }

                // PWM On
                if (!strcmp(
                    String(matrixData.output_pwm[0][current_matrix_i][1]).c_str(),
                    lv_textarea_get_text(mfc.ta_pwm_1))==0)
                    {
                        lv_textarea_set_text(mfc.ta_pwm_1, String(matrixData.output_pwm[0][current_matrix_i][0]).c_str());
                    }

                // Connected Map Slot
                lv_dropdown_set_selected(mfc.dd_map_slot, matrixData.index_mapped_value[0][current_matrix_i]);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_map_slot), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_map_slot), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);

                // Output Mode
                lv_dropdown_set_selected(mfc.dd_output_mode, matrixData.output_mode[0][current_matrix_i]);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_output_mode), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_output_mode), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);

                // Output Port
                if (!strcmp(
                    String(matrixData.matrix_port_map[0][current_matrix_i]).c_str(),
                    lv_textarea_get_text(mfc.ta_port_map))==0)
                    {
                        lv_textarea_set_text(mfc.ta_port_map, String(matrixData.matrix_port_map[0][current_matrix_i]).c_str());
                    }

                // Computer Assist
                if (mfc.matrix_switch_computer_assist.panel) {
                    if (matrixData.computer_assist[0][current_matrix_i]==true) {
                        lv_obj_set_style_outline_color(mfc.matrix_switch_computer_assist.panel, lv_color_make(255, 255, 0), LV_PART_MAIN);
                        lv_obj_set_style_text_color(mfc.matrix_switch_computer_assist.label, lv_color_make(255, 255, 0), LV_PART_MAIN);
                    }
                    else {
                        lv_obj_set_style_outline_color(mfc.matrix_switch_computer_assist.panel, lv_color_make(58, 58, 58), LV_PART_MAIN);
                        lv_obj_set_style_text_color(mfc.matrix_switch_computer_assist.label, lv_color_make(58, 58, 58), LV_PART_MAIN);
                    }
                }

                // Override
                if (mfc.matrix_switch_override.panel) {
                    lv_obj_set_style_outline_color(mfc.matrix_switch_override.panel, lv_color_make(255, 0, 0), LV_PART_MAIN);
                    lv_obj_set_style_text_color(mfc.matrix_switch_override.label, lv_color_make(255, 0, 0), LV_PART_MAIN);
                }

                // Output Value
                if (mfc.matrix_switch_output_value) {
                    lv_obj_set_style_outline_color(mfc.matrix_switch_output_value, default_outline_hue, LV_PART_MAIN);
                    lv_label_set_text(mfc.matrix_switch_output_value, String(String("") + String(matrixData.output_value[0][current_matrix_i])).c_str());
                    /* Text Color: Switch Intention (blue) */
                    if (matrixData.switch_intention[0][current_matrix_i]==true) {lv_obj_set_style_text_color(mfc.matrix_switch_output_value, lv_color_make(0, 0, 255), LV_PART_MAIN);}
                    else {
                        /* Text Color: Computer Intention (yellow) */
                        if (matrixData.computer_intention[0][current_matrix_i]==true) {lv_obj_set_style_text_color(mfc.matrix_switch_output_value, lv_color_make(255, 255, 0), LV_PART_MAIN);}
                        else {lv_obj_set_style_text_color(mfc.matrix_switch_output_value, lv_color_make(58, 58, 58), LV_PART_MAIN);}
                    }
                }
            }
        }

        // Mapping Configuration Panel
        if (current_matrix_panel_view==1) {
            if (mcc.panel) {

                // Hide
                lv_obj_add_flag(mfc.panel, LV_OBJ_FLAG_HIDDEN);
                vTaskDelay(5 / portTICK_PERIOD_MS);

                // Show
                lv_obj_remove_flag(mcc.panel, LV_OBJ_FLAG_HIDDEN);
                vTaskDelay(5 / portTICK_PERIOD_MS);

                // Switch
                lv_label_set_text(switch_matrix_mapping_panel.label, "MAP");
                lv_obj_set_style_outline_color(switch_matrix_mapping_panel.panel, default_outline_hue, LV_PART_MAIN);
                lv_obj_set_style_text_color(switch_matrix_mapping_panel.label, default_value_hue, LV_PART_MAIN);

                // Panel
                lv_obj_set_style_outline_color(mcc.panel, default_outline_hue, LV_PART_MAIN);

                // Map Slot (Remeains Static Color For Emphasis)
                lv_obj_set_style_text_color(mcc.dd_slot, default_value_hue, LV_PART_MAIN);
                lv_dropdown_set_selected(mcc.dd_slot, current_mapping_i);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_slot), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_slot), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);

