holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // ────────────────────────────────────────────────
                // System Speed
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_sys_speed, String(satioData.system_speed, 2).c_str());

                // ────────────────────────────────────────────────
                // Speed Value Mode
                // ────────────────────────────────────────────────
                if (satioData.speed_value_mode==SATIO_MODE_GPS) {
                    // User lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_speed_mode_user.panel, default_btn_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_speed_mode_user.panel, default_btn_off_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_speed_mode_user.label, default_btn_off_value_hue, LV_PART_MAIN);
                    // GPS emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_speed_mode_gps.panel, default_btn_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_speed_mode_gps.panel, default_btn_on_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_speed_mode_gps.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }
                else if (satioData.speed_value_mode==SATIO_MODE_USER) {
                    // GPS lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_speed_mode_gps.panel, default_btn_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_speed_mode_gps.panel, default_btn_off_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_speed_mode_gps.label, default_btn_off_value_hue, LV_PART_MAIN);
                    // User emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_speed_mode_user.panel, default_btn_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_speed_mode_user.panel, default_btn_on_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_speed_mode_user.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }

                // ────────────────────────────────────────────────
                // Ground Heading Name
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_ground_heading_name, String(satioData.ground_heading_name).c_str());

                // ────────────────────────────────────────────────
                // GPS Ground Heading
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_ground_heading, String(satioData.ground_heading, 2).c_str());

                // ────────────────────────────────────────────────
                // User Ground Heading
                // ────────────────────────────────────────────────
                lv_textarea_set_text(satio_c.ta_user_ground_heading, String(satioData.user_ground_heading, 2).c_str());

                // ────────────────────────────────────────────────
                // System Ground Heading
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_sys_ground_heading, String(satioData.system_ground_heading, 2).c_str());

                // ────────────────────────────────────────────────
                // Ground Heading Value Mode
                // ────────────────────────────────────────────────
                if (satioData.ground_heading_value_mode==SATIO_MODE_GPS) {
                    // User lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_ground_heading_mode_user.panel, default_btn_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_ground_heading_mode_user.panel, default_btn_off_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_ground_heading_mode_user.label, default_btn_off_value_hue, LV_PART_MAIN);
                    // GPS emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_ground_heading_mode_gps.panel, default_btn_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_ground_heading_mode_gps.panel, default_btn_on_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_ground_heading_mode_gps.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }
                else if (satioData.ground_heading_value_mode==SATIO_MODE_USER) {
                    // GPS lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_ground_heading_mode_gps.panel, default_btn_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_ground_heading_mode_gps.panel, default_btn_off_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_ground_heading_mode_gps.label, default_btn_off_value_hue, LV_PART_MAIN);
                    // User emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_ground_heading_mode_user.panel, default_btn_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_ground_heading_mode_user.panel, default_btn_on_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_ground_heading_mode_user.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }

                // vTaskDelay(5 / portTICK_PERIOD_MS);

                // ────────────────────────────────────────────────
                // Mileage
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_mileage, String(satioData.mileage).c_str());
            }
        }

        else if (current_gps_panel==1) {
            if (gngga_c.panel) {
                // Hide
                lv_obj_add_flag(gnrmc_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(gpatt_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(satio_c.panel, LV_OBJ_FLAG_HIDDEN);
                // Show
                lv_obj_remove_flag(gngga_c.panel, LV_OBJ_FLAG_HIDDEN);
                vTaskDelay(5 / portTICK_PERIOD_MS);

                // Switch Panel
                lv_obj_set_style_text_color(gps_switch_panel.switch_satio_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_satio_panel.panel, default_btn_off_bg, LV_PART_MAIN);

