holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Menu styling (menus are bootstrapped for consistant reproducibility so minimal styling is needed here)
    font_menu_title = &cobalt_alien_25;
    font_menu_item = &cobalt_alien_17;

    // Default
    default_bg_hue                  = lv_color_make(0,0,0);
    default_bg_title_hue            = lv_color_make(12,12,12);
    default_outline_hue             = lv_color_make(28,28,28);
    default_border_hue              = lv_color_make(0,0,0);
    default_shadow_hue              = lv_color_make(0,0,0);
    default_title_hue               = lv_color_make(255,0, 0);
    default_subtitle_hue            = lv_color_make(0,0, 255);
    default_value_hue               = lv_color_make(0,255,0);

    // BTN
    default_btn_bg                  = lv_color_make(12,12,12);
    default_btn_outline_hue         = lv_color_make(28,28,28);
    default_btn_border_hue          = lv_color_make(0,0,0);
    default_btn_shadow_hue          = lv_color_make(0,0,0);
    default_btn_value_hue           = lv_color_make(42,42,42);
    // BTN Default Off
    default_btn_off_bg              = lv_color_make(0,0,0);
    default_btn_off_outline_hue     = lv_color_make(28,28,28);
    default_btn_off_border_hue      = lv_color_make(0,0,0);
    default_btn_off_shadow_hue      = lv_color_make(0,0,0);
    default_btn_off_value_hue       = lv_color_make(42,42,42);
    // BTN Default On
    default_btn_on_bg               = lv_color_make(12,12,12);
    default_btn_on_outline_hue      = lv_color_make(28,28,28);
    default_btn_on_border_hue       = lv_color_make(0,0,0);
    default_btn_on_shadow_hue       = lv_color_make(0,0,0);
    default_btn_on_value_hue        = lv_color_make(0,255,0);
    // BTN Default Toggle
    default_btn_toggle_outline_hue  = lv_color_make(28,28,28);
    default_btn_toggle_value_hue    = lv_color_make(0,0,255);

    // Custom (intended to be changed by user -> sets main_hue)
    // custom_bg_hue                = lv_color_make(0,0,0);
    // custom_title_bg_hue          = lv_color_make(12,12,12);
    // custom_outline_hue           = lv_color_make(0,0,0);
    // custom_border_hue            = lv_color_make(0,0,0);
    // custom_shadow_hue            = lv_color_make(0,0,0);
    // custom_title_hue             = lv_color_make(0,0, 255);
    // custom_subtitle_hue          = lv_color_make(0,0, 255);
    // custom_value_hue             = lv_color_make(0,255,0);

    // Rainbow Hue Major
    rainbow_outline_hue          = lv_color_make(0,0,0);
    rainbow_title_hue            = lv_color_make(0,0,255);
    rainbow_value_hue            = lv_color_make(0,255,0);
    // Rainbow Hue Minor
    rainbow_contrast_outline_hue = lv_color_make(0,0,0);
    rainbow_contrast_title_hue   = lv_color_make(0,0,255);
    rainbow_contrast_value_hue   = lv_color_make(0,255,0);


    // Set Current Pallette
    // enable_rainbow_effect=false;
    setColorsDefault();

    // --------------------------------------------------------------
    // SD Card Initialization
    // --------------------------------------------------------------
    mount_sd();
    
    is_fs_ready("/sdcard"); // check mount
    
    list_directory("/sdcard"); // check read sdcard
    
    delay(1000);

    sd_lvgl_register(); // register file related callback functions with LVGL

    // --------------------------------------------------------------
    // Display Loading Screen
    // --------------------------------------------------------------
    display_loading_screen();
}

void satio_ui_begin() {
    display_timer = lv_timer_create(update_display_on_timer, 50, NULL);
}
